app/controllers/api/activities_controller.rb

    def index
      activities = Activity.all

      if category_id = params[:category_id]
        activities = activities.where(category_id: category_id)
---
SELECT "activities".* FROM "activities"
SELECT "activities".* FROM "activities" WHERE "activities"."category_id" = ?  [["category_id", 1]]

    def show
      activity = Activity.find(params[:id])
---
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT 1  [["id", 980190963]]